/*
  HWUserCenterKit.strings
  HWUserCenterKit

  Created by 易博 on 2020/8/10.
  Copyright © 2020 xttxqjfg. All rights reserved.
*/

"我的订单" = "My Orders";
"用户协议" = "Terms Of Use";
"隐私协议" = "Privacy Policy";
"分校协议" = "School Policy";
"客户支持" = "Customer Support";
"注销账号" = "Delete Account";
"积分规则" = "Coins";
"兑换好礼" = "Redeem Now";
"我的优惠券" = "My Coupons";
"诊断" = "Placement Test";
"关于我们" = "About Think Academy";
"设置" = "Setting";
"问题反馈" = "Feedback";
"选择分校" = "Education System";
"选择分校说明" = "Please choose the education system that you want your child to follow.";
"邮箱" = "Email";
"邮箱说明" = "Link your Email with your login account to receive course information and resources.";
"输入邮箱地址" = "Enter Email";
"我的积分" = "My Coins";
"免费课程" = "Unpaid Courses";
"订单列表" = "Orders";
"优惠券" = "Coupons";
"期望清单" = "Wish List";
"测试结果" = "Test Results";
"调课转班" = "Class Reschedule/Transfer";
"地址管理" = "My Addresses";
"切换账号" = "Switch Account";
"语言" = "Language";
"未绑定注册手机号和注册邮箱,暂时无法修改密码" = "The password cannot be changed. Because no mobile phone or email address linked";
"知道了" = "Got it";
"清除缓存" = "Clear Cache";
"清除缓存完成" = "Clear Cache Done";
"完善个人信息" = "Complete the student profile";
"个人信息" = "Personal Information";
"用户昵称说明" = "Display name will be used during or after classes. Letters, space and numbers are supported. 65 letters maximum. ";
"我的账户" = "My Account";
"增加一个学生" = "Add a Student";
"昵称" = "Display name";
"英文姓" = "First name";
"英文名" = "Last name";
"年级" = "Grade";
"拍照" = "Take Photo";
"从相册选取" = "Choose Photo";
"头像上传失败" = "Photo upload failed";
"个人信息更改失败" = "Edit failed";
"个人信息更改成功" = "Edit Successful";
"编辑照片" = "Edit Portrait";
"帐号切换成功" = "Switch successfully";
"帐号切换失败" = "Switch Failed";
"复制成功" = "Copied Successfully";
"复制学员编号" = "Copy";
"学员添加成功" = "Student added successfully";
"提示：同一家庭组内最多包含6位学员" = "Note: A maximum of 6 students can be associated.";
"用户名将在课堂上使用" = "Display name will be used during or after classes. Letters, space and numbers are supported. 65 letters maximum.";
"日志上传" = "Report Exceptions Log";
"日志上传提示" = "Are you sure you want to report exceptions log?";

//消息推送
"消息推送" = "Notifications";
"消息推送-标题" = "Notifications";
"打开消息推送" = "Open Push Notification";
"打开消息推送描述文案" = "Receive messages timely, for class reminder, preview tasks released, and teacher's feedback received, etc.";
"关闭消息推送" = "Receive Message Reminder";
"消息推送-关闭" = "Turn off";
"消息推送-保持开启" = "Keep it open";
"打开消息推送二次确认描述文案" = "Once turning it off, you will not receive any notifications, including class reminder, preview tasks and homework messages, etc.";
"打开消息推送二次确认描述文案-标题" = "Are you sure you want to turn it off?";

"用户昵称已经被注册" = "* Username is already taken";
"输入格式不合法" = "*This input is invalid";
"邮箱格式不合法" = "This input is invalid";
"信息填写不完整" = "All fields are required. Please complete.";

"保存" = "Save";
"版本号" = "Version";
"可更新" = "New Version Found";
"注销" = "Sign Out";
"登录" = "Sign in";
"登录后查看更多功能" = "Sign in to start learning with Think Academy";
"已是最新版本" = "You've already updated.";
"最新版本" = "Latest Version";
"新版本" = "New Version";
"内测版本" = "Beta Version";
"立即升级" = "Update Now";
"欢迎" = "Welcome";
"确认" = "Confirm";
"取消" = "Cancel";
"修改密码" = "Change Password";
"重置密码后，其他登录设备会被登出，请先确认是否有设备当前在上课" = "After changing the password, all other logged-in devices will be logged out. So please ensure your child is currently not in a live class";
"确定要退出登录吗?" = "Are you sure you want to sign out?";
"退出登录失败,请稍后再试" = "Log out failed. Please try again.";
"网络异常,请稍后再试" = "Internet error. Please try again.";

//火星分校切换
"分校切换成功" = "分校切换成功";
"切换火星分校提示消息" = "You have switched into Mars Campus.
Notice: This campus is for Internal Test Only. Please remember to switch back to your campus after testing.";
"我知道了" = "Confirm";

//意见反馈
"问题描述" = "Problem Descriptors";
"必填" = "Required";

"功能异常" = "Features Malfunction";
"功能建议" = "Features Suggestions";
"教师体验" = "Teaching";
"体验问题" = "Overall Experience";
"直播上课" = "In-Class Experience";
"其它" = "Other Problems";

"反馈内容(必填)" = "Detailed feedback(required)";

"图片" = "Images";
"选填" = "Optional";
"最多上传三张图片" = "Maximum 3 images";
"提交" = "Submit";
"提交成功" = "Submission successful";
"提交失败" = "Submission failed";

"金币商城" = "Think Coins Mall";

"小灶课" = "Temporary Classroom";

// 硬编码部分 - 需要产品给文案
"其他学生" = "Other Students";
"请选择" = "Please select";
"姓氏" = "Enter first name";
"名字" = "Enter last name";
"输入名字" = "Enter display name";

"日志上传成功" = "Log submitted, thank you for the feedback";

"添加用户-昵称不合符规则" = "Display name input is invalid";
"添加用户-名字不合符规则" = "First name input is invalid";
"添加用户-姓氏不合符规则" = "Last name input is invalid";
"添加用户-邮箱不合符规则" = "Email input is invalid";
"添加用户-请选择年级" = "Please select grade";
"添加用户-加载中" = "Loading...";



//设备检测翻译文案
//功能入口部分 - 英文，非HK分校
"设备检测" = "Device Test";
"检测描述" = "We recommend testing this device to ensure a better class experience";
"开始" = "Start";
//
////顶部面包屑 - 英文，非HK分校
"network" = "Network";
"microphone" = "Microphone";
"camera" = "Camera";
"voice" = "Sound";
//
//// 網絡測試部分 - 英文，非HK分校
"音视频测试" = "Live streaming service";
"课堂互动测试" = "Interaction service";
"服务器检测" = "Server connection speed";
"课件下载测试" = "Courseware download";
"网络满足上课需求" = "Your network meets the system requirements";
"网络不满足上课需求" = "There seems to be something wrong with your network.";
"网络不满足上课需求-点击查看" = "Check the solution suggestions";
"此项测试大约需要花费一分钟" = "This may take 1 ~ 3 minutes";
"常见网络问题建议" = "Solutions to network problems";
"尝试重启路由器" = "Try to restart your Wi-Fi router and get closer to your Wi-Fi router if use wireless network.";
"检查网络权限" = "Check and make sure your device allows Think Academy to connect to the internet";
"切换其它网络" = "Try switching to another network";
"知道了" = "Got it";
"重新测试" = "Retest";
"下一项" = "Next";

// 麦克风部分 - 英文，非HK分校
"没有麦克风权限" = "Microphone access not enable";
"在设置中打开麦克风权限" = "Please allow Think Academy to access your microphone in the system settings";
"请检查你的麦克风或者佩戴耳机" = "Please check your  microphone settings or wear headphones";
"尝试你大声读出下面的文字" = "Try reading the words below to test your microphone";
"你好" = "Hello";
"你的麦克风似乎存在问题" = "There seems to be a problem with your microphone";
"我们没有听到你的声音" = "We didn\"t hear your, check your microphone settings or try using headphones";
"麦克风检测完成" = "Microphone test complete";
"你的麦克风工作正常" = "Your microphone is working properly";
"去设置" = "Settings";

// 摄像头部分 - 英文，非HK分校
"没有摄像头权限" = "Camera access not enable";
"在设置中打摄像头风权限" = "Please allow Think Academy to access your camera in the system settings";
"可以在上面看到自己吗" = "Can you see yourself in the video above ?";
"你的摄像头似乎存在问题" = "There seems to be a problem with your camera";
"请检查你的摄像头是否正确安装" = "Please check your camera settings or switch another device";
"摄像头检测完成" = "Camera test complete";
"你的摄像头工作正常" = "Your camera is working properly";
  
// 声音测试部分 - 英文，非HK分校
"当前音量" = "Volume:";
"可以听到正在播放的音乐吗" = "Can you hear the sound being played？";
"请注意调整系统音量到适当大小" = "Please adjust the system volume to an appropriate level";
"能" = "Yes";
"不能" = "No";
"你的扬声器似乎存在问题" = "There may be a problem with your speakers";
"建议尝试佩戴耳机或者更换其它设备" = "Try using headphones or switch to another device";

//报告 - 英文，非HK分校
"你的设备满足上课要求" = "This device meets the requirements of live class";
"你的设备不完全满足上课要求" = "This device does not meet the requirements of live class";
"继续使用此设备上课可能会降低你的体验" = "Using this device may compromise your class experience";
"知道了" = "Got it";
"设备检测返回" = "Back";

// 时区
"选择时区" = "Choose Time Zone";
"搜索时区" = "Search time zone";
"搜索结果为空" = "No Result";

"拍摄视频" = "Take Video";
"视频库" = "Video Library";
"该信息将用于教师与家长沟通学生的学习情况" = "Wechat/WhatsApp/Line will be used for teachers to communicate with parents about students' learning.";
